Autodesk.Revit.DB.FilterRule.ElementPasses(Autodesk.Revit.DB.Element)
Derived classes override this method to implement the test that determines
whether the given element passes this rule or not.
element:
The element to test against the rule.
Returns:
True if the element satisfies the rule, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011